// alert(150 / 15) // уведомленеи, / - поделить, * - умножить

// console.log(10 + 15) // отабраженеи в консоли
 
// let name = prompt("введите имя") // Запрос к пользывателю

// alert(name)

// console.log(name);

// спрашиваете у пользователь: сколько будет 10 + 15 и вывести это в консоль

// 10 + 15 ввывести данное выражение

// спрашиваете у пользователь два раза, и сумму этих двух выводите в консоль

// console.log("hello" + "world");

// let num1 = +prompt("введите чсило:")

// let num2 = +prompt("введите чсило:")

// alert(num1 + num2)

// типы данных:

// 1. string - ""

// 2. number - 1, 10, 100, 1000000,

// 3. object - {}

// 4. boolean - true/false, 1/0, da/net

// 5. BigInt - 2^53

// 6. символ

// 7. null

// 8. undefined

// конкотенация - сложение строк

// console.log(10 + 15); // 25
// console.log(10 + "15"); // 1015
// console.log("15" + 10); // 1510
// console.log(15 - "10"); // 5
// console.log("10" - 15); // -5
// console.log("10" - "10"); //0

// let num1 = +prompt("введите первое число:")
// let num2 = +prompt("введите второе число:")
// let num3 = 100

// if(num1 + num2 > num3) { 
//     console.log("сумма чисел 1 и 2, больше чем 3 число");
// } else if (num1 + num2 === num3) {
//     console.log("сумма чисел 1 и 2, равна числу 3");
// } else {
//     console.log("сумма числе 1 и 2, не больше чем число 3");
// }

// условие: вы спрашиваете у пользователя 2 числа,
// далее получаете сумму этих чиел и эту сумму сравниваете с num 3

// == не строгое равенстов

// === здесь учитываем типы данных

// спрашиваете у пользователь два раза и говрите если число
// 1 > чем число 2, то выводите в конcоль, иначе выводите в alert

// let num1 = 23
// let num2 = 25

// console.log(num2 = num1); - присваеванеи

// alert("Hello") 

// let num = 10 

// if( num == "" ) { // условие
//     console.log("Больше") // действие
// } else if (num < 10) {
//     console.log("меньше") // действие
// } else {
//     console.log("Равно")
// }   


// function year(num) { // название(аргумент)
//     let result
//     result = Math.floor(num / 100) + 1
//     return result    
// }

// console.log(year(prompt("введите год"))) // year(входные данные) - вызов функции

// let arr = [ 12, 15, "12", true, [19, 12, "hello"] ]

// console.log(arr.reverse())